//  Напишите программу, которая принимает на вход трёхзначное 
// число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.WriteLine("Введите трёхзначное число!");
// int num=Convert.ToInt32 ( Console.ReadLine());

// int num1=num/10;
// int num2=num1%10;

// if ((num>1000 )||(num<100))
// {
//     Console.WriteLine("не верное число!");
// }
// else if ((num>99)&&(num<1000))
// {
//     Console.WriteLine(num2);
// }

//____________________________________________________________________________________________

//Напишите программу, которая выводит третью цифру 
// заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.WriteLine("Введите число!");
// int num=Convert.ToInt32 ( Console.ReadLine());

// if (num<100)
// {
//     Console.WriteLine("третьей цифры нет");
// }
// else
// {
//     while ((num>=1000 || num<99))
//     {
//       num=num/10;
//     }
//     Console.WriteLine(num%10);
// }

//_____________________________________________________________________


//  Напишите программу, которая принимает на вход цифру,
//  обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.WriteLine("Введите число");
// int num=Convert.ToInt32 ( Console.ReadLine());


// if(num==1)
// {
//     Console.WriteLine("нет");
// }
// if(num==2)
// {
//     Console.WriteLine("нет");
// }
// if(num==3)
// {
//     Console.WriteLine("нет");
// }
// if(num==4)
// {
//     Console.WriteLine("нет");
// }
// if(num==5)
// {
//     Console.WriteLine("нет");
// }
// if(num==6)
// {
//     Console.WriteLine("да");
// }
// if(num==7)
// {
//     Console.WriteLine("да");
// }
// else
// {
//     Console.WriteLine("такого дня нет");
// }
    




